bouffalolab/bouffalo_sdk/bsp/board/bl702ldk/board.c
#include "math.h"

#include "bflb_uart.h"
#include "bflb_gpio.h"
#include "bflb_clock.h"
#include "bflb_rtc.h"
#include "bflb_flash.h"
#include "bflb_sec_mutex.h"
#include "bflb_ef_ctrl.h"
#include "bflb_efuse.h"
#include "bflb_spi_psram.h"
#include "bflb_sf_cfg.h"
#include "hardware/sf_ctrl_reg.h"

#include "bl702l_glb.h"
#include "bl702l_clock.h"
#include "bl702l_l1c.h"
#include "ef_data_reg.h"
#if (defined CFG_BLUETOOTH_ENABLED) || (defined CFG_M154_ENABLED)
#include "bl702l_ef_cfg.h"
#include "bl702l_phy.h"
#endif

#include "board.h"

#include "mm.h"

extern void log_start(void);

extern uint32_t __HeapBase;
extern uint32_t __HeapLimit;
extern uint32_t __psram_heap_base;
extern uint32_t __psram_limit;

static struct bflb_device_s *uart0;

#if defined(CONFIG_BFLB_LOG)
static struct bflb_device_s *rtc;
#endif

static void system_clock_init(void)
{
#if (defined CFG_BLUETOOTH_ENABLED) || (defined CFG_M154_ENABLED)
    int idx_cap_code = -1;
    uint8_t capcode;
#endif

    GLB_Set_System_CLK(GLB_DLL_XTAL_32M, GLB_SYS_CLK_DLL128M);
    GLB_Set_MTimer_CLK(1, GLB_MTIMER_CLK_XCLK, Clock_System_Clock_Get(BL_SYSTEM_CLOCK_XCLK) / 1000000 - 1);
    HBN_Set_XCLK_CLK_Sel(HBN_XCLK_CLK_XTAL);
    // HBN_Power_On_Xtal_32K();
    // HBN_32K_Sel(HBN_32K_XTAL);

#if (defined CFG_BLUETOOTH_ENABLED) || (defined CFG_M154_ENABLED)
    idx_cap_code = bflb_efuse_read_xtal_capcode(&capcode);
    if (idx_cap_code >= 0) {
        AON_Set_Xtal_CapCode(capcode, capcode);
    }
#endif
}

static void peripheral_clock_init(void)
{
    PERIPHERAL_CLOCK_ADC_DAC_ENABLE();
    PERIPHERAL_CLOCK_SEC_ENABLE();
    PERIPHERAL_CLOCK_DMA0_ENABLE();
    PERIPHERAL_CLOCK_UART0_ENABLE();
    PERIPHERAL_CLOCK_SPI0_ENABLE();
    PERIPHERAL_CLOCK_I2C0_ENABLE();
    PERIPHERAL_CLOCK_PWM0_ENABLE();
    PERIPHERAL_CLOCK_TIMER0_1_WDG_ENABLE();
    PERIPHERAL_CLOCK_IR_ENABLE();

    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_CHECKSUM);

    GLB_Set_UART_CLK(ENABLE, HBN_UART_CLK_XCLK, 0);
    GLB_Set_SPI_CLK(ENABLE, GLB_SPI_CLK_SRC_XCLK, 0);
    GLB_Set_I2C_CLK(ENABLE, GLB_I2C_CLK_SRC_XCLK, 0);
    GLB_Set_ADC_CLK(ENABLE, GLB_ADC_CLK_SRC_XCLK, 1);
    GLB_Set_IR_CLK(ENABLE, GLB_IR_CLK_SRC_XCLK, 15);
    GLB_Set_PKA_CLK_Sel(GLB_PKA_CLK_SRC_DLL128M);
}

#ifdef CONFIG_PSRAM
static struct spi_psram_cfg_type ap_memory1604 = {
    .read_id_cmd = 0x9F,
    .read_id_dmy_clk = 0,
    .burst_toggle_cmd = 0xC0,
    .reset_enable_cmd = 0x66,
    .reset_cmd = 0x99,
    .enter_quad_mode_cmd = 0x35,
    .exit_quad_mode_cmd = 0xF5,
    .read_reg_cmd = 0xB5,
    .read_reg_dmy_clk = 1,
    .write_reg_cmd = 0xB1,
    .read_cmd = 0x03,
    .read_dmy_clk = 0,
    .f_read_cmd = 0x0B,
    .f_read_dmy_clk = 1,
    .f_read_quad_cmd = 0xEB,
    .f_read_quad_dmy_clk = 3,
    .write_cmd = 0x02,
    .quad_write_cmd = 0x38,
    .page_size = 512,
    .burst_toggle_en = ENABLE,
    .ctrl_mode = PSRAM_SPI_CTRL_MODE,
    .drive_strength = PSRAM_DRIVE_STRENGTH_50_OHMS,
    .burst_length = PSRAM_BURST_LENGTH_512_BYTES,
};

static struct sf_ctrl_cmds_cfg cmds_cfg = {
    .cmds_en = 1,
    .cmds_wrap_mode = 0,
    .cmds_wrap_len = SF_CTRL_WRAP_LEN_512,
};

static struct sf_ctrl_psram_cfg psram_cfg = {
    .owner = SF_CTRL_OWNER_SAHB,
    /* Legacy BL702L uses internal flash on SF1 and external PSRAM on SF2. */
    .pad_sel = SF_CTRL_PAD1,
    .bank_sel = SF_CTRL_SEL_PSRAM,
    .psram_rx_clk_invert_src = 1,
    .psram_rx_clk_invert_sel = 0,
    .psram_delay_src = 1,
    .psram_clk_delay = 1,
};

/* The bl702ldk board wires PSRAM to the SF2 pad. efuse psram_info marks the
 * internal 2MB package; that init path is not implemented, so such chips
 * fail here instead of being misconfigured through the external path. */
__attribute__((noinline)) int ATTR_TCM_SECTION board_psram_init(void)
{
    bflb_efuse_device_info_type device_info;
    uint32_t sf_ctrl_0, sf_ctrl_1, sf_ctrl_2;
    uint8_t psram_id[8] = { 0 };
    int rst_ret, drv_ret, wrap_ret;

    bflb_efuse_get_device_info(&device_info);
    if (device_info.psram_info != 1) {
        return -1;
    }

    /* Snapshot the sf controller state: restored on psram init failure so
     * flash access keeps working (no driver api can save/restore these
     * registers as a whole). */
    sf_ctrl_0 = getreg32(BFLB_SF_CTRL_BASE + SF_CTRL_0_OFFSET);
    sf_ctrl_1 = getreg32(BFLB_SF_CTRL_BASE + SF_CTRL_1_OFFSET);
    sf_ctrl_2 = getreg32(BFLB_SF_CTRL_BASE + SF_CTRL_2_OFFSET);

    bflb_sf_cfg_init_ext_flash_gpio(0);
    bflb_sf_ctrl_psram_init(&psram_cfg);
    bflb_sf_ctrl_cmds_set(&cmds_cfg, SF_CTRL_SEL_PSRAM);
    bflb_sf_ctrl_burst_toggle_set(ap_memory1604.burst_toggle_en, ap_memory1604.ctrl_mode);
    drv_ret = bflb_psram_setdrivestrength(&ap_memory1604);
    wrap_ret = bflb_psram_setburstwrap(&ap_memory1604);
    rst_ret = bflb_psram_softwarereset(&ap_memory1604, ap_memory1604.ctrl_mode);
    bflb_psram_readid(&ap_memory1604, psram_id);

    bflb_sf_ctrl_sbus_select_bank(SF_CTRL_SEL_FLASH);

    if (rst_ret != 0 || drv_ret != 0 || wrap_ret != 0 || psram_id[0] != 0x0d) {
        putreg32(sf_ctrl_0, BFLB_SF_CTRL_BASE + SF_CTRL_0_OFFSET);
        putreg32(sf_ctrl_1, BFLB_SF_CTRL_BASE + SF_CTRL_1_OFFSET);
        putreg32(sf_ctrl_2, BFLB_SF_CTRL_BASE + SF_CTRL_2_OFFSET);
        return -1;
    }

    bflb_psram_cache_write_set(&ap_memory1604, SF_CTRL_QIO_MODE, ENABLE, DISABLE, ENABLE);
    L1C_Cache_Enable_Set(L1C_WAY_DISABLE_NONE);

    return 0;
}
#endif

uint32_t board_psram_size_get(void)
{
    return 2 * 1024 * 1024;
}

void bl_show_log(void)
{
    printf("\r\n");
    printf("  ____               __  __      _       _       _     \r\n");
    printf(" |  _ \\             / _|/ _|    | |     | |     | |    \r\n");
    printf(" | |_) | ___  _   _| |_| |_ __ _| | ___ | | __ _| |__  \r\n");
    printf(" |  _ < / _ \\| | | |  _|  _/ _` | |/ _ \\| |/ _` | '_ \\ \r\n");
    printf(" | |_) | (_) | |_| | | | || (_| | | (_) | | (_| | |_) |\r\n");
    printf(" |____/ \\___/ \\__,_|_| |_| \\__,_|_|\\___/|_|\\__,_|_.__/ \r\n");
    printf("\r\n");
    printf("Build:%s,%s\r\n", __TIME__, __DATE__);
    printf("Copyright (c) 2022 Bouffalolab team\r\n");
}

void bl_show_flashinfo(void)
{
    spi_flash_cfg_type flashCfg;
    uint8_t *pFlashCfg = NULL;
    uint32_t flashSize = 0;
    uint32_t flashCfgLen = 0;
    uint32_t flashJedecId = 0;

    flashJedecId = bflb_flash_get_jedec_id();
    flashSize = bflb_flash_get_size();
    bflb_flash_get_cfg(&pFlashCfg, &flashCfgLen);
    arch_memcpy((void *)&flashCfg, pFlashCfg, flashCfgLen);
    printf("======== flash cfg ========\r\n");
    printf("flash size 0x%08X\r\n", flashSize);
    printf("jedec id     0x%06X\r\n", flashJedecId);
    printf("mid              0x%02X\r\n", flashCfg.mid);
    printf("iomode           0x%02X\r\n", flashCfg.io_mode);
    printf("clk delay        0x%02X\r\n", flashCfg.clk_delay);
    printf("clk invert       0x%02X\r\n", flashCfg.clk_invert);
    printf("read reg cmd0    0x%02X\r\n", flashCfg.read_reg_cmd[0]);
    printf("read reg cmd1    0x%02X\r\n", flashCfg.read_reg_cmd[1]);
    printf("write reg cmd0   0x%02X\r\n", flashCfg.write_reg_cmd[0]);
    printf("write reg cmd1   0x%02X\r\n", flashCfg.write_reg_cmd[1]);
    printf("qe write len     0x%02X\r\n", flashCfg.qe_write_reg_len);
    printf("cread support    0x%02X\r\n", flashCfg.c_read_support);
    printf("cread code       0x%02X\r\n", flashCfg.c_read_mode);
    printf("burst wrap cmd   0x%02X\r\n", flashCfg.burst_wrap_cmd);
    printf("===========================\r\n");
}

extern void bflb_uart_set_console(struct bflb_device_s *dev);

static void console_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_uart_init(gpio, GPIO_PIN_14, GPIO_UART_FUNC_UART0_TX);
    bflb_gpio_uart_init(gpio, GPIO_PIN_15, GPIO_UART_FUNC_UART0_RX);

    struct bflb_uart_config_s cfg;
    cfg.baudrate = CONFIG_CONSOLE_UART_BAUDRATE;
    cfg.data_bits = UART_DATA_BITS_8;
    cfg.stop_bits = UART_STOP_BITS_1;
    cfg.parity = UART_PARITY_NONE;
    cfg.flow_ctrl = 0;
    cfg.tx_fifo_threshold = 7;
    cfg.rx_fifo_threshold = 0;

    uart0 = bflb_device_get_by_name("uart0");

    bflb_uart_init(uart0, &cfg);
    bflb_uart_set_console(uart0);
}

void ram_heap_init(void)
{
    static const uint32_t any_alloc_order[] = {
        MM_HEAP_OCRAM_0,
        MM_HEAP_PSRAM_0,
    };
    size_t heap_len;

    /* ram heap init */
    mem_manager_init();

    /* ocram heap init */
    heap_len = ((size_t)&__HeapLimit - (size_t)&__HeapBase);
    mm_register_heap(MM_HEAP_OCRAM_0, "OCRAM", MM_ALLOCATOR_TLSF, &__HeapBase, heap_len);

#ifdef CONFIG_PSRAM
    if (board_psram_init() != 0) {
        printf("psram init failed\r\n");
        while (1) {}
    }

    heap_len = (size_t)&__psram_limit - (size_t)&__psram_heap_base;
    mm_register_heap(MM_HEAP_PSRAM_0, "PSRAM", MM_ALLOCATOR_TLSF, &__psram_heap_base, heap_len);

    /* ram info dump */
    printf("dynamic memory init success\r\n"
           "  ocram heap size: %d Kbyte, \r\n"
           "  psram heap size: %d Kbyte\r\n",
           ((size_t)&__HeapLimit - (size_t)&__HeapBase) / 1024,
           ((size_t)&__psram_limit - (size_t)&__psram_heap_base) / 1024);
#else
    /* ram info dump */
    printf("dynamic memory init success\r\n"
           "  ocram heap size: %d Kbyte \r\n",
           ((size_t)&__HeapLimit - (size_t)&__HeapBase) / 1024);
#endif

    mm_heap_set_any_alloc_order(any_alloc_order, sizeof(any_alloc_order) / sizeof(any_alloc_order[0]));
}

void board_init(void)
{
    int ret = -1;
    uintptr_t flag;

    flag = bflb_irq_save();

    ret = bflb_flash_init();

    system_clock_init();
    peripheral_clock_init();
    bflb_irq_initialize();

    console_init();

    /* heap init */
    ram_heap_init();

#ifndef CONFIG_BOARD_SHOW_LOG_DISABLE
    bl_show_log();
#endif
    if (ret != 0) {
        printf("flash init fail!!!\r\n");
    }
    bl_show_flashinfo();

    printf("cgen1:%08x\r\n", getreg32(BFLB_GLB_CGEN1_BASE));
#if defined(CONFIG_BFLB_LOG)
    rtc = bflb_device_get_by_name("rtc");
#endif

    bflb_sec_mutex_init();

    bflb_irq_restore(flag);

    printf("board init done\r\n");
    printf("===========================\r\n");
}

void board_uartx_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* just use console uart pin */
    bflb_gpio_uart_init(gpio, GPIO_PIN_0, GPIO_UART_FUNC_UART0_CTS);
    bflb_gpio_uart_init(gpio, GPIO_PIN_1, GPIO_UART_FUNC_UART0_RTS);
}

void board_i2c0_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* I2C0_SDA */
    bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_FUNC_I2C0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* I2C0_SCL */
    bflb_gpio_init(gpio, GPIO_PIN_10, GPIO_FUNC_I2C0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_spi0_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* spi mosi */
    bflb_gpio_init(gpio, GPIO_PIN_8, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* spi miso */
    bflb_gpio_init(gpio, GPIO_PIN_9, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* spi cs */
    bflb_gpio_init(gpio, GPIO_PIN_10, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* spi clk */
    bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_pwm_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* pwm0 ch 0 */
    bflb_gpio_init(gpio, GPIO_PIN_0, GPIO_FUNC_PWM0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);

    /* pwm1 ch 0 */
    /* pwm1 ch 1 */
    /* pwm1 ch 2 */
    /* pwm1 ch 3 */
    bflb_gpio_init(gpio, GPIO_PIN_1, GPIO_FUNC_PWM1 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_2, GPIO_FUNC_PWM1 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_8, GPIO_FUNC_PWM1 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_9, GPIO_FUNC_PWM1 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_adc_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");

    /* ch0 and ch1 is for uart log */
    /* adc ch 0 */
    // bflb_gpio_init(gpio, GPIO_PIN_14, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    // /* adc ch 1 */
    // bflb_gpio_init(gpio, GPIO_PIN_15, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* adc ch 2 */
    bflb_gpio_init(gpio, GPIO_PIN_17, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* adc ch 3 */
    bflb_gpio_init(gpio, GPIO_PIN_18, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);

    /* ch4~ch6 are only for BL704L */
    // /* adc ch 4 */
    // bflb_gpio_init(gpio, GPIO_PIN_19, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    // /* adc ch 5 */
    // bflb_gpio_init(gpio, GPIO_PIN_20, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    // /* adc ch 6 */
    // bflb_gpio_init(gpio, GPIO_PIN_21, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* adc ch 7 */
    bflb_gpio_init(gpio, GPIO_PIN_7, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* adc ch 8 */
    bflb_gpio_init(gpio, GPIO_PIN_8, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* adc ch 9 */
    bflb_gpio_init(gpio, GPIO_PIN_9, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* adc ch 10 */
    bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);

    /* ch11 is only for BL704L */
    // /* adc ch 11 */
    // bflb_gpio_init(gpio, GPIO_PIN_12, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
}

void board_ir_gpio_init(void)
{
    struct bflb_device_s *gpio;

    /* Can only use GPIO18 or GPIO22 */
    uint32_t pin = GPIO_PIN_22;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, pin, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);

    GLB_IR_LED_Driver_Enable();

    if (pin == GPIO_PIN_22) {
        GLB_IR_LED_Driver_Output_Enable(GLB_IR_LED0);
    } else if (pin == GPIO_PIN_18) {
        GLB_IR_LED_Driver_Output_Enable(GLB_IR_LED1);
    }
}

void board_keyscan_gpio_init(void)
{
    struct bflb_device_s *gpio;

    HBN_AON_PAD_CFG_Type aonPadCfg = {
        .ctrlEn = 0,
        .ie = 0,
        .pullUp = 0,
        .pullDown = 0,
        .oe = 0,
    };
    HBN_Aon_Pad_Cfg(1, HBN_AON_PAD_GPIO30, &aonPadCfg);
    HBN_Aon_Pad_Cfg(1, HBN_AON_PAD_GPIO31, &aonPadCfg);
    HBN_Hw_Pu_Pd_Cfg(0);

    gpio = bflb_device_get_by_name("gpio");
    /* keyscan driver io init // col */
    bflb_gpio_init(gpio, GPIO_PIN_3,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_8,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_9,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_10,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_20,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_21,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_22,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_29,
                   GPIO_FUN_KEY_SCAN_DRIVE | GPIO_ALTERNATE | GPIO_OUTPUT | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    GLB_Set_Kys_Drv_Col(0); // GPIO output value
    /* keyscan input io init // row */
    bflb_gpio_init(gpio, GPIO_PIN_11,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_12,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_13,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_17,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_18,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_19,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_30,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
    bflb_gpio_init(gpio, GPIO_PIN_31,
                   GPIO_FUN_KEY_SCAN_IN | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1); //
}

void board_timer_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    GLB_Sel_TMR_GPIO_Clock(GPIO_PIN_0);
    bflb_gpio_init(gpio, GPIO_PIN_0, GPIO_FUNC_CLKOUT | GPIO_ALTERNATE | GPIO_PULLDOWN | GPIO_SMT_EN | GPIO_DRV_1);
}

#if defined(CONFIG_BSP_LCD)

void board_lcd_spi_0_hard_4_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* LCD_SPI_DAT */
    bflb_gpio_init(gpio, GPIO_PIN_15, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLDOWN | GPIO_SMT_EN | GPIO_DRV_1);
    /* LCD_SPI_CLK */
    bflb_gpio_init(gpio, GPIO_PIN_13, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

#if defined(GPIO_FUNC_SPI1)
void board_lcd_spi_1_hard_4_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* LCD_SPI_DAT */
    bflb_gpio_init(gpio, GPIO_PIN_15, GPIO_FUNC_SPI1 | GPIO_ALTERNATE | GPIO_PULLDOWN | GPIO_SMT_EN | GPIO_DRV_1);
    /* LCD_SPI_CLK */
    bflb_gpio_init(gpio, GPIO_PIN_13, GPIO_FUNC_SPI1 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}
#endif
#endif
#if (defined CFG_BLUETOOTH_ENABLED) || (defined CFG_M154_ENABLED)
void rf_reset_done_callback(void)
{
#if (defined CFG_BLUETOOTH_ENABLED) && (defined CFG_M154_ENABLED)
    rf_set_bz_mode(MODE_BZ_COEX);
#elif defined(CFG_BLUETOOTH_ENABLED)
    rf_set_bz_mode(MODE_BLE_ONLY);
    else rf_set_bz_mode(MODE_ZB_ONLY);
#endif
}

void rf_full_cal_start_callback(uint32_t addr, uint32_t size)
{
    /** TBD: need to check memory access conflict on DMA and rf calculation*/
}
#endif

#ifdef CONFIG_BFLB_LOG
__attribute__((weak)) uint64_t bflb_log_clock(void)
{
    return bflb_mtimer_get_time_us();
}

__attribute__((weak)) uint32_t bflb_log_time(void)
{
    return BFLB_RTC_TIME2SEC(bflb_rtc_get_time(rtc));
}

__attribute__((weak)) char *bflb_log_thread(void)
{
    return "";
}
#endif
